{
  "TITLE": "BRL-CAD: Open Source Solid Modeling",
  "NAVIGATION": {
    "DOWNLOAD": "Download",
    "NEWS": "News",
    "ABOUT": "About",
    "DOCS": "Docs",
    "SUPPORT": "Support",
    "GALLERY": "Gallery"
  },
  "MAIN": {
    "TITLE": "<1>BRL</1><1>-</1><1>CAD</1>",
    "TAG": "Think • Invent • Create",
    "BUTTON": "CONTRIBUTE"
  },
  "FEATURES": {
    "FEATURE_1": {
      "TITLE": "Open Source!",
      "DESCRIPTION": "100% FREE with people all over the world contributing their thoughts. Escape vendor lock-in, for any purpose, forever."
    },
    "FEATURE_2": {
      "TITLE": "Join Us!",
      "DESCRIPTION": "Help make a better CAD system, make modeling fun. No experience necessary.",
      "BUTTON": "Learn More (35MB PDF)"
    },
    "FEATURE_3": {
      "TITLE": "Solid Modeling!",
      "DESCRIPTION": "Hybrid CSG and B-REP kernel with innovative methods for unambiguous 3D geometry. Verification, validation, performant."
    }
  },
  "INFORMATION": {
    "TITLE": "What is BRL-CAD?",
    "DESCRIPTION": "BRL-CAD is a powerful open source cross-platform solid modeling system that includes interactive geometry editing, high-performance ray-tracing for rendering and geometric analysis, a system performance analysis benchmark suite, geometry libraries for application developers, and more than 30 years of active development."
  },
  "HIGHLIGHTS": {
    "TITLE": "Highlights",
    "HIGHLIGHT_1": {
      "TITLE": "Cross platform",
      "DESCRIPTION": "The package is intentionally designed to be extensively cross-platform and is actively developed on and maintained for many common operating system environments including for BSD, Linux, Solaris, Mac OS X, and Windows among others. BRL-CAD is distributed in binary and source code form."
    },
    "HIGHLIGHT_2": {
      "TITLE": "Trusted by U.S Military",
      "DESCRIPTION": "BRL-CAD is choice of U.S Military. For more than 20 years, BRL-CAD has been the primary tri-service solid modeling CAD system used by the U.S. military to model weapons systems for vulnerability and lethality analyses."
    },
    "HIGHLIGHT_3": {
      "TITLE": "Since 1979",
      "DESCRIPTION": "Mike Muuss began the initial architecture and design of BRL-CAD back in 1979. Development as a unified package began in 1983. The first public release was made in 1984. BRL-CAD became an open source project on 21 December 2004.",
      "BUTTON": "Learn More"
    },
    "HIGHLIGHT_4": {
      "TITLE": "Free & Open",
      "DESCRIPTION": "BRL-CAD respects your freedom so our code is open source under OSI approved license terms, which means you can customize it according to your needs.It also means that you will get this software Free of cost and we won't charge you ever for any update or support."
    }
  },
  "ABOUT": {
    "TITLE": "About Us",







    "ABOUT_1": {
      "TITLE": "WHY DEVELOP BRL-CAD?",
      "FULL_TITLE": "WHY DEVELOP BRL-CAD?",
      "DESCRIPTION": "<1><0>SOLIDITY</0> - BRL-CAD is tailored to specialized engineering analysis work where solid ray tracing must correctly, faithfully, robustly, & consistently evaluate solid geometry models.</1><1><0>PERFORMANCE</0> - Analyses often evaluate tens of millions of paths through complex models. BRL-CAD has the fastest solid ray tracing, more validated and faster than any other CAD.</1><1><0>INDEPENDENCE</0> - Open Source development enables individuals, groups, & governments to avoid vendor lock-in, reduce licensing costs, share maintenance, & be more adaptive to needs.</1><1><0>CUSTOMIZATION</0> - BRL-CAD may be freely inspected, improved, & extended by anyone. Development is accelerated through simplified licensing, public discourse, and an international community of contributors.</1><1><0>ENTERPRISE</0> - Since 1979, BRL-CAD`s geometry & code have enhanced production workflows & applications around the world. Hundreds of BRL-CAD models exist in the U.S. Government for AJEM alone.</1><1>BRL-CAD is tuned to specific analytic needs & considerations, more than any other CAD.</1>"
    },
    "ABOUT_2": {
      "TITLE": "History and Vision",
      "FULL_TITLE": "History and Vision",
      "DESCRIPTION": "<1>BRL-CAD was originally conceived and written by the late Michael Muuss, the inventor of the popular PING network program. In 1979, the U.S. Army Ballistic Research Laboratory (BRL) (the agency responsible for creating ENIAC, the world's first general-purpose electronic computer in the 1940s) identified a need for tools that could assist with the computer simulations and analysis of combat vehicle systems and environments. When no existing CAD package was found to be adequate for this specialized purpose, Mike and fellow software developers began developing and assembling a unique suite of utilities capable of interactively displaying, editing, and interrogating geometric models. Those early efforts subsequently became the foundation on which BRL-CAD was built.</1><1>Development of BRL-CAD as a unified software package began in 1983, and its first public release came in 1984. Then, in 2004, BRL-CAD was converted from a limited-distribution U.S. government-controlled code to an open source project, with portions licensed under the LGPL and BSD licenses.</1><1>Today, the package's source code repository is credited as being the world's oldest, continuously developed open source repository. As a project, pride is taken in preserving all history and contributions.</1><1>The ongoing vision for BRL-CAD development is to provide a robust, powerful, flexible, and comprehensive solid modeling system that includes:</1><2><0>Faithful high-performance geometric representation.</0><0>Efficient and intuitive geometry editing.</0><0>Comprehensive conversion support for all solid geometry formats.</0><0>Effective geometric analysis tools for 3D CAD.</0><2>"
    },
    "ABOUT_3": {
      "TITLE": "Key Strengths",
      "FULL_TITLE": "Key Strengths",
      "DESCRIPTION": "<1>All CAD packages are not alike. Among the many strengths of the BRL-CAD package are the following:</1><2><0>BRL-CAD is open source! Don't like something? You can make it better.</0><0>You can leverage decades of invested development. BRL-CAD is the most feature-filled open source CAD system available, with hundreds of years time invested.</0><0>Your work will get used. BRL-CAD is in production use and downloaded thousands of times every month by people all around the world.</0><0>You have the ability to create extensively detailed realistic models.</0><0>You can model objects on scales ranging from (potentially) the subatomic through the galactic, while essentially providing all the details, all the time.</0><0>You can leverage one of the fastest raytracers in existence (for many types of geometry).</0><0>You can convert to and from a wide range of geometry file formats.</0><0>BRL-CAD has a powerful, customizable scripting interface with many advanced editing and processing capabilities.</0></2>"
    },
    "ABOUT_4": {
      "TITLE": "Want to Contribute?",
      "FULL_TITLE": "Want to Be a Contributor?",
      "DESCRIPTION": "<1>With BRL-CAD being a part of the open source community since 2004, contributors from all over the world are able to enhance the features and functions of the package in many different ways. In return, these contributors have had a unique opportunity to:</1><2><0>Join a team of passionate and talented contributors who share the common values of open source development. Open source emphasizes free redistribution; openly available source code; full, open participation; and nondescrimination against individuals, groups, technologies, or fields of interest. (To learn more, see http://opensource.org.)</0><0>Drive needed improvements in the open source software community's support for solid modeling and CAD software capabilities.</0><0>Experiment with new and state-of-the-art algorithms and ideas within the context of a fully open CAD system that is in production use and has an established user community.</0><0>Become a better developer. Whether you're a newbie or a seasoned developer with decades of experience, you can always work on a BRL-CAD project that is catered toward improving your abilities.</0><0>Become part of a legacy. Participate in a robust and historically significant open source project that goes all the way back to the days of the DEC PDP-11/70 and VAX-11/780.</0><0>Gain practical experience working on a real-world, large-scale software project.</0></2>"
    }
  },
  "PROJECT": {
    "TITLE": "Our Repositories",
    "DESCRIPTION": "Mike Muuss began the initial architecture and design of BRL-CAD back in 1979. Development as a unified package began in 1983. The first public release was made in 1984. BRL-CAD became an open source project on 21 December 2004.",
    "BUTTON": "View All",
    "VIEW_ALL": "Visit Github"
  },
  "GET_INVOLVED": {
    "TITLE": "BRL-CAD is <1>backed by open</1> source community",
    "BUTTON": "Get Involved"
  },
  "FOOTER": {
    "TITLE": "BRL-CAD © 2021",
    "DESCRIPTION": "All trademarks referenced herein are the properties of their respective owners. This site is not sponsored, endorsed, or run by the U.S. Government."
  }
}
